RT-Thread/rt-thread/bsp/gd32103c-eval/Libraries/GD32F1xx_standard_peripheral/Include/gd32f10x_eth.h
/** @defgroup ETH_Deferral_Check
  * @{
  */
#define ETH_DEFERRALCHECK_ENABLE                        ((uint32_t)0x00000010)
#define ETH_DEFERRALCHECK_DISABLE                       ((uint32_t)0x00000000)

/**
  * @}
  */

/** @defgroup ETH_Filter_Disable
  * @{
  */
#define ETH_FILTERDISABLE_ENABLE                        ((uint32_t)0x80000000)
#define ETH_FILTERDISABLE_DISABLE                       ((uint32_t)0x00000000)

/**
  * @}
  */

/** @defgroup ETH_Source_Addr_Filter
  * @{
  */
#define ETH_SOURCEADDRFILTER_NORMAL_ENABLE              ((uint32_t)0x00000200)
#define ETH_SOURCEADDRFILTER_INVERSE_ENABLE             ((uint32_t)0x00000300)
#define ETH_SOURCEADDRFILTER_DISABLE                    ((uint32_t)0x00000000)

/**
  * @}
  */

/** @defgroup ETH_Pass_Control_Frames
  * @{
  */
#define ETH_PASSCONTROLFRAMES_BLOCKALL                  ((uint32_t)0x00000040)
#define ETH_PASSCONTROLFRAMES_FORWARDALL                ((uint32_t)0x00000080)
#define ETH_PASSCONTROLFRAMES_FORWARDPASSEDADDRFILTER   ((uint32_t)0x000000C0)

/**
  * @}
  */

/** @defgroup ETH_Broadcast_Frames_Reception
  * @{
  */
#define ETH_BROADCASTFRAMESRECEPTION_ENABLE             ((uint32_t)0x00000000)
#define ETH_BROADCASTFRAMESRECEPTION_DISABLE            ((uint32_t)0x00000020)

/**
  * @}
  */

/** @defgroup ETH_Destination_Addr_Filter
  * @{
  */
#define ETH_DESTINATIONADDRFILTER_NORMAL                ((uint32_t)0x00000000)
#define ETH_DESTINATIONADDRFILTER_INVERSE               ((uint32_t)0x00000008)

/**
  * @}
  */

/** @defgroup ETH_Promiscuous_Mode
  * @{
  */
#define ETH_PROMISCUOUSMODE_ENABLE                      ((uint32_t)0x00000001)
#define ETH_PROMISCUOUSMODE_DISABLE                     ((uint32_t)0x00000000)

/**
  * @}
  */

/** @defgroup ETH_Multicast_Frames_Filter
  * @{
  */
#define ETH_MULTICASTFRAMESFILTER_PERFECTHASHTABLE      ((uint32_t)0x00000404)
#define ETH_MULTICASTFRAMESFILTER_HASHTABLE             ((uint32_t)0x00000004)
#define ETH_MULTICASTFRAMESFILTER_PERFECT               ((uint32_t)0x00000000)
#define ETH_MULTICASTFRAMESFILTER_NONE                  ((uint32_t)0x00000010)


/**
  * @}
  */

/** @defgroup ETH_Unicast_Frames_Filter
  * @{
  */
#define ETH_UNICASTFRAMESFILTER_PERFECTHASHTABLE        ((uint32_t)0x00000402)
#define ETH_UNICASTFRAMESFILTER_HASHTABLE               ((uint32_t)0x00000002)
#define ETH_UNICASTFRAMESFILTER_PERFECT                 ((uint32_t)0x00000000)

/**
  * @}
  */


/** @defgroup ETH_Zero_Quanta_Pause
  * @{
  */
#define ETH_ZEROQUANTAPAUSE_ENABLE                      ((uint32_t)0x00000000)
#define ETH_ZEROQUANTAPAUSE_DISABLE                     ((uint32_t)0x00000080)
/**
  * @}
  */

/** @defgroup ETH_Pause_Low_Threshold
  * @{
  */
#define ETH_PAUSELOWTHRESHOLD_MINUS4                    ((uint32_t)0x00000000)
#define ETH_PAUSELOWTHRESHOLD_MINUS28                   ((uint32_t)0x00000010)
#define ETH_PAUSELOWTHRESHOLD_MINUS144                  ((uint32_t)0x00000020)
#define ETH_PAUSELOWTHRESHOLD_MINUS256                  ((uint32_t)0x00000030)

/**
  * @}
  */

/** @defgroup ETH_RFD_Threshold
  * @{
  */
#define ETH_RFD_256BYTES                                ((uint32_t)0x00000000)
#define ETH_RFD_512BYTES                                ((uint32_t)0x00000010)
#define ETH_RFD_768BYTES                                ((uint32_t)0x00000020)
#define ETH_RFD_1024BYTES                               ((uint32_t)0x00000030)
#define ETH_RFD_1280BYTES                               ((uint32_t)0x00000040)
#define ETH_RFD_1536BYTES                               ((uint32_t)0x00000050)
#define ETH_RFD_1792BYTES                               ((uint32_t)0x00000060)

/**
  * @}
  */

/** @defgroup ETH_RFA_Threshold
  * @{
  */
#define ETH_RFA_256BYTES                                ((uint32_t)0x00000000)
#define ETH_RFA_512BYTES                                ((uint32_t)0x00000001)
#define ETH_RFA_768BYTES                                ((uint32_t)0x00000002)
#define ETH_RFA_1024BYTES                               ((uint32_t)0x00000003)
#define ETH_RFA_1280BYTES                               ((uint32_t)0x00000004)
#define ETH_RFA_1536BYTES                               ((uint32_t)0x00000005)
#define ETH_RFA_1792BYTES                               ((uint32_t)0x00000006)

/**
  * @}
  */

/** @defgroup ETH_Unicast_Pause_Frame_Detect
  * @{
  */
#define ETH_UNICASTPAUSEFRAMEDETECT_ENABLE              ((uint32_t)0x00000008)
#define ETH_UNICASTPAUSEFRAMEDETECT_DISABLE             ((uint32_t)0x00000000)

/**
  * @}
  */

/** @defgroup ETH_Receive_Flow_Control
  * @{
  */
#define ETH_RECEIVEFLOWCONTROL_ENABLE                   ((uint32_t)0x00000004)
#define ETH_RECEIVEFLOWCONTROL_DISABLE                  ((uint32_t)0x00000000)

/**
  * @}
  */

/** @defgroup ETH_Transmit_Flow_Control
  * @{
  */
#define ETH_TRANSMITFLOWCONTROL_ENABLE                  ((uint32_t)0x00000002)
#define ETH_TRANSMITFLOWCONTROL_DISABLE                 ((uint32_t)0x00000000)

/**
  * @}
  */

/** @defgroup ETH_VLAN_Tag_Comparison
  * @{
  */
#define ETH_VLANTAGCOMPARISON_12BIT                     ((uint32_t)0x00010000)
#define ETH_VLANTAGCOMPARISON_16BIT                     ((uint32_t)0x00000000)

/**
  * @}
  */

/** @defgroup ETH_MAC_Flags
  * @{
  */
#define ETH_MAC_FLAG_TST                                ((uint32_t)0x00000200)  /*!< Time stamp trigger flag (on MAC) */
#define ETH_MAC_FLAG_MSCT                               ((uint32_t)0x00000040)  /*!< MSC transmit flag  */
#define ETH_MAC_FLAG_MSCR                               ((uint32_t)0x00000020)  /*!< MSC receive flag */
#define ETH_MAC_FLAG_MSC                                ((uint32_t)0x00000010)
#define ETH_MAC_FLAG_WUM                                ((uint32_t)0x00000008)
/**
  * @}
  */

/** @defgroup ETH_MAC_Interrupts
  * @{
  */
#define ETH_MAC_INT_TST                                  ((uint32_t)0x00000200)  /*!< Time stamp trigger interrupt (on MAC) */
#define ETH_MAC_INT_MSCT                                 ((uint32_t)0x00000040)  /*!< MSC transmit interrupt */
#define ETH_MAC_INT_MSCR                                 ((uint32_t)0x00000020)  /*!< MSC receive interrupt */
#define ETH_MAC_INT_MSC                                  ((uint32_t)0x00000010)
#define ETH_MAC_INT_WUM                                  ((uint32_t)0x00000008)
/**
  * @}
  */

/** @defgroup ETH_MAC_addresses
  * @{
  */
#define ETH_MAC_ADDRESS0                                ((uint32_t)0x00000000)
#define ETH_MAC_ADDRESS1                                ((uint32_t)0x00000008)
#define ETH_MAC_ADDRESS2                                ((uint32_t)0x00000010)
#define ETH_MAC_ADDRESS3                                ((uint32_t)0x00000018)
/**
  * @}
  */

